package sec1;

public class Ex2 {

	public static void main(String[] args) {
		// 변수명,함수명,클래스명 규칙
		// 1. 변수명,함수명,클래스명 등은 예약어 (명령 키워드)는 사용할 수 없다.
		// 2. 변수명,함수명,클래스명은 대소문자를 엄격히 구분합니다.
		// 3. 변수명,함수명,클래스명은 영문으로 시작해야 한다. (단 $, _로 시작 할 수는 없다.)
		// 4. 변수명,함수명,클래스명은 관례상 여러 단어가 조합되는 경우는 카멜방식 또는 언더스코어 방식을 활용한다.
		// 5. 변수명,함수명,클래스명은 관례상 그 뜻이나 용도를 쉽게 알 수 있게 해야한다.
		
		// icandoit => iCanDoIt(카멜 방식)
		// icandoit => i_can_do_it (언더스코어 방식)
		
		// 예약어는 사용할 수 없으므로 예약어와 비슷한 용도로 변수명을 활용하는 경우는 예악어 뒤에 숫자 등을 붙임
		
		String name;
		
		int public1;
		
		// 변수명은 대소문자를 엄격히 구분하므로, 선언시에 다름을 반드시 알고 있어야 함
		int a, A;
		
		// 변수명은 영문으로 시작해야 하나, $나 _는 활용할 수 있다.
		int $kor;
		
		// 관례상 카멜방식과 언더스코어방식을 활용하는 방안
		int iCanDoIt;
		int i_can_do_it;
		
		


	}

}
